state-design pattern vending machine example
